In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Read the csv file

In [4]:
df_employee = pd.read_csv("medium_employee_dataset.csv")

# Print the first 5 rows

In [5]:
df_employee.head()

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

# Print the last 10 rows

In [6]:
df_employee.tail(10)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
299990,Monica Bender,"Wallace, Smith and Shepard",Production engineer,New Cindychester,Bangladesh,852660,Full Time,3.0
299991,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400,Full Time,1.5
299992,Steven Thornton,"Baker, Allen and Edwards",Patent examiner,Aliciafort,Benin,60240,Full Time,4.3
299993,Terry Hill,"White, Mcclain and Cobb","Investment banker, corporate",New Cindychester,Sweden,414720,Intern,2.3
299994,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270,Full Time,3.6
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770,Intern,3.3

# Print the number of rows

In [9]:
len(df_employee.index)

300000

#  Print the number of columns

In [16]:
df_employee.shape[1]

8

# Print all column names

In [28]:
list(df_employee.columns)

['Name',
 'Company_Name',
 'Employee_Job_Title',
 'Employee_City',
 'Employee_Country',
 'Employee_Salary',
 'Employment_Status',
 'Employee_Rating']

# Print the mean of Employee_Salary

In [29]:
df_employee["Employee_Salary"].mean()

500224.20772666665

# Print the mean of Employee_Rating

In [30]:
df_employee["Employee_Rating"].mean()

2.5059550000000295

# Print all the distinct Company_Name

In [41]:
df_employee["Company_Name"].unique()

array(['James and Sons', 'Nichols-James', 'Scott Inc',
       'Johnston, Fleming and Tanner', 'Baker, Allen and Edwards',
       'Andrade LLC', 'Matthews Inc', 'Taylor-Ramos',
       'Campos, Reynolds and Mccormick', 'White, Mcclain and Cobb',
       'Thomas-Spencer', 'Bullock-Carrillo', 'Marshall-Holloway',
       'Wallace, Smith and Shepard', 'Nelson-Li'], dtype=object)

# Print the number of distinct Company_Name

In [39]:
len(df_employee["Company_Name"].unique())

15